#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
module.main.data.archive_file.lambda_function: Reading...
module.main.data.archive_file.lambda_function: Read complete after 0s [id=966380112fc320910fd80bf456aff3d9a512764d]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_ssm_parameter.twitter_api_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiSecret]
module.main.aws_ssm_parameter.twitter_access_token_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessTokenSecret]
module.main.aws_ssm_parameter.twitter_api_key: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiKey]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_ssm_parameter.twitter_access_token: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessToken]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.main.aws_scheduler_schedule_group.group will be created
  + resource "aws_scheduler_schedule_group" "group" {
      + arn                    = (known after apply)
      + creation_date          = (known after apply)
      + id                     = (known after apply)
      + last_modification_date = (known after apply)
      + name                   = "lapwing-item-news-dev-scheduler-group"
      + name_prefix            = (known after apply)
      + region                 = "ap-northeast-1"
      + state                  = (known after apply)
      + tags_all               = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_ssm_parameter.twitter_access_token is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "twitter_access_token" {
      ~ arn              = "arn:aws:ssm:ap-northeast-1:087164360110:parameter/lapwing-item-news/dev/Twitter/AccessToken" -> (known after apply)
      ~ data_type        = "text" -> (known after apply)
      ~ has_value_wo     = true -> (known after apply)
      ~ id               = "/lapwing-item-news/dev/Twitter/AccessToken" -> (known after apply)
      + insecure_value   = (known after apply)
      ~ key_id           = "alias/aws/ssm" -> (known after apply)
        name             = "/lapwing-item-news/dev/Twitter/AccessToken"
      - tags             = {} -> null
      ~ tier             = "Standard" -> (known after apply)
      + value            = (sensitive value)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.twitter_access_token_secret is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "twitter_access_token_secret" {
      ~ arn              = "arn:aws:ssm:ap-northeast-1:087164360110:parameter/lapwing-item-news/dev/Twitter/AccessTokenSecret" -> (known after apply)
      ~ data_type        = "text" -> (known after apply)
      ~ has_value_wo     = true -> (known after apply)
      ~ id               = "/lapwing-item-news/dev/Twitter/AccessTokenSecret" -> (known after apply)
      + insecure_value   = (known after apply)
      ~ key_id           = "alias/aws/ssm" -> (known after apply)
        name             = "/lapwing-item-news/dev/Twitter/AccessTokenSecret"
      - tags             = {} -> null
      ~ tier             = "Standard" -> (known after apply)
      + value            = (sensitive value)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.twitter_api_key is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "twitter_api_key" {
      ~ arn              = "arn:aws:ssm:ap-northeast-1:087164360110:parameter/lapwing-item-news/dev/Twitter/ApiKey" -> (known after apply)
      ~ data_type        = "text" -> (known after apply)
      ~ has_value_wo     = true -> (known after apply)
      ~ id               = "/lapwing-item-news/dev/Twitter/ApiKey" -> (known after apply)
      + insecure_value   = (known after apply)
      ~ key_id           = "alias/aws/ssm" -> (known after apply)
        name             = "/lapwing-item-news/dev/Twitter/ApiKey"
      - tags             = {} -> null
      ~ tier             = "Standard" -> (known after apply)
      + value            = (sensitive value)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.main.aws_ssm_parameter.twitter_api_secret is tainted, so must be replaced
-/+ resource "aws_ssm_parameter" "twitter_api_secret" {
      ~ arn              = "arn:aws:ssm:ap-northeast-1:087164360110:parameter/lapwing-item-news/dev/Twitter/ApiSecret" -> (known after apply)
      ~ data_type        = "text" -> (known after apply)
      ~ has_value_wo     = true -> (known after apply)
      ~ id               = "/lapwing-item-news/dev/Twitter/ApiSecret" -> (known after apply)
      + insecure_value   = (known after apply)
      ~ key_id           = "alias/aws/ssm" -> (known after apply)
        name             = "/lapwing-item-news/dev/Twitter/ApiSecret"
      - tags             = {} -> null
      ~ tier             = "Standard" -> (known after apply)
      + value            = (sensitive value)
      ~ version          = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 4 to destroy.

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment `/deploy 18232062024 ` on this PR.